# SQLAlchemy를 이용한 데이터 입출력

In [1]:
## SQL 패키지 import

import pymysql
from sqlalchemy import create_engine
import pandas as pd
from pandas import DataFrame
from matplotlib import pyplot

## 데이터베이스 접속정보 초기화

In [2]:
HOSTNAME = 'localhost'
PORT = 3306
USERNAME = 'root'
PASSWORD = 'root'
DATABASE = 'myschool'
CHARSET1 = 'utf8'
CHARSET2= 'utf-8'

## 데이터베이스 접속하기

### 접속 문자열 생성하기

In [3]:
con_str_fmt = 'mysql+mysqldb://{0}:{1}@{2}:{3}/{4}?charset={5}'
con_str = con_str_fmt.format(USERNAME, PASSWORD, HOSTNAME, PORT, DATABASE, CHARSET1)
con_str

'mysql+mysqldb://root:root@localhost:3306/myschool?charset=utf8'

### 데이터베이스 접속

In [4]:
# pymysql을 사용하여 MySQL 연동 객체 설치
pymysql.install_as_MySQLdb()
import MySQLdb

In [6]:
engine = create_engine(con_str, encoding=CHARSET2)
conn = engine.connect()

## 데이터 저장하기

In [7]:
df1 = DataFrame([
    {'deptno': 300, 'dname': '학과1', 'loc': '위치1'},
    {'deptno': 301, 'dname': '학과2', 'loc': '위치2'},
    {'deptno': 302, 'dname': '학과3', 'loc': '위치3'}
])
df1

   deptno dname  loc
0     300   학과1  위치1
1     301   학과2  위치2
2     302   학과3  위치3

In [9]:
df1.to_sql(name='department_py', con=conn, if_exists='replace', index=True)

In [10]:
# index를 제외하고 저장
df1.to_sql(name='department_py', con=conn, if_exists='replace', index=False)

### 인덱스 칼럼이 있는 DataFrame의 경우

In [11]:
df2 = DataFrame([
    {'deptno': 300, 'dname': '학과1', 'loc': '위치1'},
    {'deptno': 301, 'dname': '학과2', 'loc': '위치2'},
    {'deptno': 302, 'dname': '학과3', 'loc': '위치3'}
])
df2.set_index('deptno', inplace=True)
df2

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [12]:
df2.to_sql(name='department_py', con=conn, if_exists='replace', index=True)

## 데이터베이스 조회하기

## 부분조회

In [14]:
sql = 'select deptno, dname, loc from department_py where deptno=300'
df3 = pd.read_sql(sql, index_col = 'deptno', con=conn)
df3

       dname  loc
deptno
300      학과1  위치1

In [16]:
# 테이블 가져오기
df4 = pd.read_sql_table('department_py', index_col = 'deptno', con=conn)
df4

       dname  loc
deptno
300      학과1  위치1
301      학과2  위치2
302      학과3  위치3

In [18]:
# 칼럼 지정하기
df5 = pd.read_sql_table('department_py', index_col='deptno',columns=['dname'], con=conn)
df5

       dname
deptno
300      학과1
301      학과2
302      학과3

In [19]:
# 접속해제
conn.close()